app/Http/Controllers/Chats/ChatController.php

update `messages` set `deleted_at` = '2020-09-21 15:41:20', `messages`.`updated_at` = '2020-09-21 15:41:20' where `id` = 3
---
    public function destroyMessage(int $id)
    {
        $message = $this->messageRepository->find($id);
        $this->authorize('delete', $message);
        $message->delete();