app/Repositories/Eloquent/ChatRepository.php

insert into `participants` (`chat_id`, `user_id`) values (13, 1)
---
    public function createParticipants($chat_id, array $data)
    {
        $chat = $this->model->find($chat_id);
        $chat->participants()->sync($data);

select * from `participants` where `chat_id` = 13
select * from `messages` where `messages`.`chat_id` in (12) and `messages`.`deleted_at` is null
select `chats`.*, `participants`.`user_id` as `pivot_user_id`, `participants`.`chat_id` as `pivot_chat_id` from `chats` inner join `participants` on `chats`.`id` = `participants`.`chat_id` where `participants`.`user_id` = 2
select `users`.*, `participants`.`chat_id` as `pivot_chat_id`, `participants`.`user_id` as `pivot_user_id` from `users` inner join `participants` on `users`.`id` = `participants`.`user_id` where `participants`.`chat_id` in (12)
---
    public function getUserChats()
    {
      //  dd(auth()->user()->chats()->with(['messages', 'participants'])->get());
        return auth()->user()->chats()
            ->with(['messages', 'participants'])
            ->get();