app/Models/User.php

    public function getChatWithUser($user_id)
    {
        $chat = $this->chats()->whereHas('participants', function ($query) use ($user_id){
            $query->where('user_id', $user_id);
        })->first();
---
select `chats`.*, `participants`.`user_id` as `pivot_user_id`, `participants`.`chat_id` as `pivot_chat_id` from `chats` inner join `participants` on `chats`.`id` = `participants`.`chat_id` where `participants`.`user_id` = 1 and exists (select * from `users` inner join `participants` on `users`.`id` = `participants`.`user_id` where `chats`.`id` = `participants`.`chat_id` and `user_id` = 3) limit 1